app/views/shared/_busqueda.html.erb

SELECT `districts`.* FROM `districts`
---
    <label for="">DISTRITO</label>
    <%= select("post", "person_id", District.all.collect {|p| [ p.no_distrito, p.district_id ] }, {prompt: 'Selecciona Distrito'}) %>