app/views/home/_busqueda.html.erb


                <%= select("post", "person_id", District.all.collect {|p| [ p.no_distrito, p.district_id ] }, {prompt: 'Selecciona Distrito'}) %>
---
SELECT `districts`.* FROM `districts`