app/controllers/home_controller.rb

SELECT `restaurants`.* FROM `restaurants`
---
  def locales
    @restaurants = Restaurant.all